const fs = require('fs');
const path = require('path');
const os = require('os');
const settings = require('../settings');

function formatUptime(seconds) {
    const d = Math.floor(seconds / (3600 * 24));
    const h = Math.floor((seconds % (3600 * 24)) / 3600);
    const m = Math.floor((seconds % 3600) / 60);
    const s = Math.floor(seconds % 60);
    return `${d}d ${h}h ${m}m ${s}s`;
}

function getRamUsage() {
    const total = (os.totalmem() / 1024 / 1024 / 1024).toFixed(1);
    const used = ((os.totalmem() - os.freemem()) / 1024 / 1024 / 1024).toFixed(1);
    return `${used}GB of ${total}GB`;
}

async function helpCommand(sock, chatId, message) {
    const uptime = formatUptime(process.uptime());
    const ramUsage = getRamUsage();
    const speed = (Math.random() * (300-10) + 10).toFixed(2);

    const helpMessage = `
╔═══〔 ❍  ꜰᴏᴄᴜꜱ ᴍᴅ 〕═══❒ bruh🍻 


║╭───────────────◆
║│ *❍ ꜰᴏᴄᴜꜱ ᴍᴅ ᴍᴇɴᴜ*
║╰───────────────◆
╚══════════════════❒

╔══════════════════❒
║ ❍ *ʙᴏᴛ ɪɴғᴏ* ❍
║ ❍ *ᴘʀᴇғɪx:* [ . ]
║ ❍ *ᴏᴡɴᴇʀ:* ᴛᴀꜰʟᴏ-ᴛᴇᴄʜ~ᴛᴀꜰᴀᴅᴢᴡᴀ-ᴛᴋᴛ  
║ ❍ *ᴍᴏᴅᴇ:* ᴘᴜʙʟɪᴄ
║ ❍ *sᴘᴇᴇᴅ:*  ${speed} ᴍs
║ ❍ *ᴜᴘᴛɪᴍᴇ:* ${uptime}
║ ❍ *ʀᴀᴍ:* ${ramUsage}
╚══════════════════❒

╔══════════════════❒
║ ❍ *ɢᴇɴᴇʀᴀʟ* ❍
║ ❍ .ʜᴇʟᴘ ᴏʀ .ᴍᴇɴᴜ
║ ❍ .ᴘɪɴɢ
║ ❍ .ᴀʟɪᴠᴇ
║ ❍ .ᴛᴛs <ᴛᴇxᴛ>
║ ❍ .ᴏᴡɴᴇʀ
║ ❍ .ᴊᴏᴋᴇ
║ ❍ .ǫᴜᴏᴛᴇ
║ ❍ .ғᴀᴄᴛ
║ ❍ .ᴡᴀᴇᴀᴛʜᴇʀ <ᴄɪᴛʏ>
║ ❍ .ɴᴇᴡs
║ ❍ .ᴀᴛᴛᴘ <ᴛᴇxᴛ>
║ ❍ .ʟʏʀɪᴄs <sᴏɴɢ>
║ ❍ .8ʙᴀʟʟ <ǫᴜᴇsᴛɪᴏɴ>
║ ❍ .ɢʀᴏᴜᴘɪɴғᴏ
║ ❍ .sᴛᴀғғ ᴏʀ .ᴀᴅᴍɪɴs
║ ❍ .ᴠᴠ
║ ❍ .ᴛʀᴛ <ᴛᴇxᴛ> <ʟᴀɴɢ>
║ ❍ .ss <ʟɪɴᴋ>
║ ❍ .ᴊɪᴅ
║ ❍ .ᴜʀʟ
╚══════════════════❒

╔══════════════════❒
║ ❍ *ᴛᴏᴏʟs* ❍
║ ❍ .ǫʀᴄᴏᴅᴇ <ᴛᴇxᴛ/ʟɪɴᴋ>
║ ❍ .ʀᴇᴀᴅǫʀ
║ ❍ .sʜᴏʀᴛᴜʀʟ <ʟɪɴᴋ>
║ ❍ .ᴀғᴋ <ʀᴇᴀsᴏɴ>
║ ❍ .ɢᴇɴᴘᴀss <ʟᴇɴɢᴛʜ>
║ ❍ .ɢᴇᴛᴘᴘ
╚══════════════════❒
𝕮𝑅𝓔𝓐𝓣𝓞𝓡: 𝕯𝓔𝓥 𝕿𝐀𝐅𝐀𝐃𝐙𝐖𝐀-𝐓𝐊𝐓
╔══════════════════❒
║ ❍ *ᴀᴅᴍɪɴ* ❍
║ ❍ .ʙᴀɴ @ᴜsᴇʀ
║ ❍ .ᴜɴʙᴀɴ @ᴜsᴇʀ
║ ❍ .ᴘʀᴏᴍᴏᴛᴇ @ᴜsᴇʀ
║ ❍ .ᴅᴇᴍᴏᴛᴇ @ᴜsᴇʀ
║ ❍ .ᴋɪᴄᴋ @ᴜsᴇʀ
║ ❍ .ᴍᴜᴛᴇ <ᴍɪɴᴜᴛᴇs>
║ ❍ .ᴜɴᴍᴜᴛᴇ
║ ❍ .ᴅᴇʟᴇᴛᴇ ᴏʀ .ᴅᴇʟ
║ ❍ .ᴡᴀʀɴɪɴɢs @ᴜsᴇʀ
║ ❍ .ᴡᴀʀɴ @ᴜsᴇʀ
║ ❍ .ᴛᴀɢᴀʟʟ
║ ❍ .ᴛᴀɢ <ᴍᴇssᴀɢᴇ>
║ ❍ .ᴛᴀɢɴᴏᴛᴀᴅᴍɪɴ
║ ❍ .ʜɪᴅᴇᴛᴀɢ <ᴍᴇssᴀɢᴇ>
║ ❍ .ᴀɴᴛɪʟɪɴᴋ <ᴏɴ/ᴏғғ>
║ ❍ .ᴀɴᴛɪʙᴀᴅᴡᴏʀᴅ
║ ❍ .ᴄʟᴇᴀʀ
║ ❍ .ᴄʜᴀᴛʙᴏᴛ
║ ❍ .ʀᴇsᴇᴛʟɪɴᴋ
║ ❍ .ᴀɴᴛɪᴛᴀɢ <ᴏɴ/ᴏғғ>
║ ❍ .ᴡᴇʟᴄᴏᴍᴇ <ᴏɴ/ᴏғғ>
║ ❍ .ɢᴏᴏᴅʙʏᴇ <ᴏɴ/ᴏғғ>
║ ❍ .sᴇᴛɢᴅᴇsᴄ <ᴅᴇsᴄ>
║ ❍ .sᴇᴛɢɴᴀᴍᴇ <ɴᴀᴍᴇ>
║ ❍ .sᴇᴛɢᴘᴘ
╚══════════════════❒

╔══════════════════❒
║ ❍ *ʟᴇᴠᴇʟ sʏsᴛᴇᴍ* ❍
║ ❍ .ʀᴀɴᴋ
║ ❍ .ʟᴇᴠᴇʟ
║ ❍ .ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ
║ ❍ .ʟʙ
║ ❍ .ᴀᴅᴅxᴘ @ᴜsᴇʀ <ᴀᴍᴏᴜɴᴛ>
║ ❍ .ʀᴇᴍᴏᴠᴇxᴘ @ᴜsᴇʀ <ᴀᴍᴏᴜɴᴛ>
║ ❍ .ᴄʟᴀɪᴍ
╚══════════════════❒

╔══════════════════❒
║ ❍ *sᴄʀɪᴘᴛᴜʀᴇ* ❍
║ ❍ .ʙɪʙʟᴇ <ʀᴇғᴇʀᴇɴᴄᴇ>
║ ❍ .ʙɪʙʟᴇ ʀᴀɴᴅᴏᴍ
║ ❍ .ǫᴜʀᴀɴ <sᴜʀᴀʜ:ᴀʏᴀʜ>
║ ❍ .ǫᴜʀᴀɴ ʀᴀɴᴅᴏᴍ
╚══════════════════❒

╔══════════════════❒
║ ❍ *ɢɪᴛʜᴜʙ* ❍
║ ❍ .ɢɪᴛ
║ ❍ .ɢɪᴛʜᴜʙ
║ ❍ .sᴄ
║ ❍ .sᴄʀɪᴘᴛ
║ ❍ .ʀᴇᴘᴏ
╚══════════════════❒

╔══════════════════❒
║ ❍ *ɪᴍᴀɢᴇ / sᴛɪᴄᴋᴇʀ* ❍
║ ❍ .ʙʟᴜʀ
║ ❍ .sɪᴍᴀɢᴇ
║ ❍ .sᴛɪᴄᴋᴇʀ
║ ❍ .ʀᴇᴍᴏᴠᴇʙɢ
║ ❍ .ʀᴇᴍɪɴɪ
║ ❍ .ᴄʀᴏᴘ
║ ❍ .ᴛɢsᴛɪᴄᴋᴇʀ
║ ❍ .ᴍᴇᴍᴇ
║ ❍ .ᴛᴀᴋᴇ <ᴘᴀᴄᴋɴᴀᴍᴇ>
║ ❍ .ᴇᴍᴏᴊɪᴍɪx <ᴇᴍᴏᴊɪ1>+<ᴇᴍᴏᴊɪ2>
║ ❍ .ɪɢs <ʟɪɴᴋ>
║ ❍ .ɪɢsᴄ <ʟɪɴᴋ>
╚══════════════════❒

╔══════════════════❒
║ ❍ *ᴘɪᴇs* ❍
║ ❍ .ᴘɪᴇs <ᴄᴏᴜɴᴛʀʏ>
║ ❍ .ᴄʜɪɴᴀ
║ ❍ .ɪɴᴅᴏɴᴇsɪᴀ
║ ❍ .ᴊᴀᴘᴀɴ
║ ❍ .ᴋᴏʀᴇᴀ
║ ❍ .ᴛʜᴀɪʟᴀɴᴅ
║ ❍ .ᴍᴀʟᴀʏsɪᴀ
║ ❍ .ɪɴᴅɪᴀ
╚══════════════════❒

╔══════════════════❒
║ ❍ *ɢᴀᴍᴇs* ❍
║ ❍ .ᴛɪᴄᴛᴀᴄᴛᴏᴇ @ᴜsᴇʀ
║ ❍ .ʜᴀɴɢᴍᴀɴ
║ ❍ .ɢᴜᴇss <ʟᴇᴛᴛᴇʀ>
║ ❍ .ᴛʀɪᴠɪᴀ
║ ❍ .ᴀɴsᴡᴇʀ <ᴀɴsᴡᴇʀ>
║ ❍ .ᴛʀᴜᴛʜ
║ ❍ .ᴅᴀʀᴇ
╚══════════════════❒

╔══════════════════❒
║ ❍ *ғᴜɴ* ❍
║ ❍ .ᴄᴏᴍᴘʟɪᴍᴇɴᴛ @ᴜsᴇʀ
║ ❍ .ɪɴsᴜʟᴛ @ᴜsᴇʀ
║ ❍ .ғʟɪʀᴛ
║ ❍ .sʜᴀʏᴀʀɪ
║ ❍ .ɢᴏᴏᴅɴɪɢʜᴛ
║ ❍ .ʀᴏsᴇᴅᴀʏ
║ ❍ .ᴄʜᴀʀᴀᴄᴛᴇʀ @ᴜsᴇʀ
║ ❍ .ᴡᴀsᴛᴇᴅ @ᴜsᴇʀ
║ ❍ .sʜɪᴘ @ᴜsᴇʀ
║ ❍ .sɪᴍᴘ @ᴜsᴇʀ
║ ❍ .sᴛᴜᴘɪᴅ @ᴜsᴇʀ [ᴛᴇxᴛ]
║ ❍ .ᴘᴘ @ᴜsᴇʀ
║ ❍ .ɢᴀʏᴍᴇᴛᴇʀ @ᴜsᴇʀ
║ ❍ .ʜᴏʀɴʏʀᴀᴛᴇ @ᴜsᴇʀ
║ ❍ .ʀɪᴢᴢ @ᴜsᴇʀ
║ ❍ .sɪɢᴍᴀ @ᴜsᴇʀ
║ ❍ .ʙʀᴀɪɴʀᴏᴛ @ᴜsᴇʀ
╚══════════════════❒

╔══════════════════❒
║ ❍ *ᴀɪ* ❍
║ ❍ .ɢᴘᴛ <ǫᴜᴇsᴛɪᴏɴ>
║ ❍ .ɢᴇᴍɪɴɪ <ǫᴜᴇsᴛɪᴏɴ>
║ ❍ .ɪᴍᴀɢɪɴᴇ <ᴘʀᴏᴍᴘᴛ>
║ ❍ .ғʟᴜx <ᴘʀᴏᴍᴘᴛ>
║ ❍ .sᴏʀᴀ <ᴘʀᴏᴍᴘᴛ>
║ ❍ .ᴛᴀɢʀᴇᴘʟʏ <ᴏɴ/ᴏғғ>
╚══════════════════❒

╔══════════════════❒
║ ❍ *ᴛᴇxᴛᴍᴀᴋᴇʀ* ❍
║ ❍ .ᴍᴇᴛᴀʟʟɪᴄ <ᴛᴇxᴛ>
║ ❍ .ɪᴄᴇ <ᴛᴇxᴛ>
║ ❍ .sɴᴏᴡ <ᴛᴇxᴛ>
║ ❍ .ɪᴍᴘʀᴇssɪᴠᴇ <ᴛᴇxᴛ>
║ ❍ .ᴍᴀᴛʀɪx <ᴛᴇxᴛ>
║ ❍ .ʟɪɢʜᴛ <ᴛᴇxᴛ>
║ ❍ .ɴᴇᴏɴ <ᴛᴇxᴛ>
║ ❍ .ᴅᴇᴠɪʟ <ᴛᴇxᴛ>
║ ❍ .ᴘᴜʀᴘʟᴇ <ᴛᴇxᴛ>
║ ❍ .ᴛʜᴜɴᴅᴇʀ <ᴛᴇxᴛ>
║ ❍ .ʟᴇᴀᴠᴇs <ᴛᴇxᴛ>
║ ❍ .1917 <ᴛᴇxᴛ>
║ ❍ .ᴀʀᴇɴᴀ <ᴛᴇxᴛ>
║ ❍ .ʜᴀᴄᴋᴇʀ <ᴛᴇxᴛ>
║ ❍ .sᴀɴᴅ <ᴛᴇxᴛ>
║ ❍ .ʙʟᴀᴄᴋᴘɪɴᴋ <ᴛᴇxᴛ>
║ ❍ .ɢʟɪᴛᴄʜ <ᴛᴇxᴛ>
║ ❍ .ғɪʀᴇ <ᴛᴇxᴛ>
╚══════════════════❒

╔══════════════════❒
║ ❍ *ᴅᴏᴡɴʟᴏᴀᴅᴇʀ* ❍
║ ❍ .ᴘʟᴀʏ <sᴏɴɢ>
║ ❍ .sᴏɴɢ <sᴏɴɢ>
║ ❍ .sᴘᴏᴛɪғʏ <ǫᴜᴇʀʏ>
║ ❍ .ɪɴsᴛᴀɢʀᴀᴍ <ʟɪɴᴋ>
║ ❍ .ғᴀᴄᴇʙᴏᴏᴋ <ʟɪɴᴋ>
║ ❍ .ᴛɪᴋᴛᴏᴋ <ʟɪɴᴋ>
║ ❍ .ᴠɪᴅᴇᴏ <sᴏɴɢ>
║ ❍ .ʏᴛᴍᴘ4 <ʟɪɴᴋ>
╚══════════════════❒

╔══════════════════❒
║ ❍ *ɴᴏᴛᴇ sʏsᴛᴇᴍ* ❍
║ ❍ .ɴᴏᴛᴇ ᴀᴅᴅ <ᴛɪᴛʟᴇ> | <ᴄᴏɴᴛᴇɴᴛ>
║ ❍ .ɴᴏᴛᴇ ʟɪsᴛ
║ ❍ .ɴᴏᴛᴇ ɢᴇᴛ <ɪᴅ>
║ ❍ .ɴᴏᴛᴇ ᴅᴇʟᴇᴛᴇ <ɪᴅ>
║ ❍ .ɴᴏᴛᴇ ᴄʟᴇᴀʀ
║ ❍ .ɴᴏᴛᴇ ʀᴇᴍɪɴᴅ <1ᴍ/1ʜ> <ᴛɪᴛʟᴇ> | <ᴄᴏɴᴛᴇɴᴛ>
╚══════════════════❒

╔══════════════════❒
║ ❍ *ᴍɪsᴄ* ❍
║ ❍ .ʜᴇᴀʀᴛ
║ ❍ .ʜᴏʀɴʏ
║ ❍ .ᴄɪʀᴄʟᴇ
║ ❍ .ʟɢʙᴛ
║ ❍ .ʟᴏʟɪᴄᴇ
║ ❍ .ɪᴛs-sᴏ-sᴛᴜᴘɪᴅ
║ ❍ .ɴᴀᴍᴇᴄᴀʀᴅ
║ ❍ .ᴏᴏɢᴡᴀʏ
║ ❍ .ᴛᴡᴇᴇᴛ
║ ❍ .ʏᴛᴄᴏᴍᴍᴇɴᴛ
║ ❍ .ᴄᴏᴍʀᴀᴅᴇ
║ ❍ .ɢᴀʏ
║ ❍ .ɢʟᴀss
║ ❍ .ᴊᴀɪʟ
║ ❍ .ᴘᴀssᴇᴅ
║ ❍ .ᴛʀɪɢɢᴇʀᴇᴅ
╚══════════════════❒

╔══════════════════❒
║ ❍ *sᴛᴀᴛᴜs* ❍
║ ❍ .ᴘᴏsᴛsᴛᴀᴛᴜs <ᴛᴇxᴛ>
║ ❍ .ᴘᴏsᴛɪᴍɢsᴛ <ᴄᴀᴘᴛɪᴏɴ>
║ ❍ .ᴘᴏsᴛᴠɪᴅsᴛ <ᴄᴀᴘᴛɪᴏɴ>
║ ❍ .ɢᴄsᴛᴀᴛᴜs <ᴛᴇxᴛ>
║ ❍ .ᴛᴏɢᴄsᴛᴀᴛᴜs <ᴛᴇxᴛ>
╚══════════════════❒

╔══════════════════❒
║ ❍ *ᴀɴɪᴍᴇ* ❍
║ ❍ .ᴀɴɪᴍᴜ <ᴛʏᴘᴇ>
║ ❍ .ɴᴏᴍ
║ ❍ .ᴘᴏᴋᴇ
║ ❍ .ᴄʀʏ
║ ❍ .ᴋɪss
║ ❍ .ᴘᴀᴛ
║ ❍ .ʜᴜɢ
║ ❍ .ᴡɪɴᴋ
║ ❍ .ғᴀᴄᴇᴘᴀʟᴍ
╚══════════════════❒

╔══════════════════❒
║ ❍ *ᴏᴡɴᴇʀ* ❍
║ ❍ .ᴍᴏᴅᴇ <ᴘᴜʙʟɪᴄ/ᴘʀɪᴠᴀᴛᴇ>
║ ❍ .sᴇᴛᴘᴘ
║ ❍ .ᴄʟᴇᴀʀsᴇssɪᴏɴ
║ ❍ .ᴀɴᴛɪᴅᴇʟᴇᴛᴇ
║ ❍ .ᴄʟᴇᴀʀᴛᴍᴘ
║ ❍ .ᴜᴘᴅᴀᴛᴇ
║ ❍ .sᴇᴛᴛɪɴɢs
║ ❍ .ᴀʀᴇᴀᴄᴛ <ᴏɴ/ᴏғғ>
║ ❍ .ᴀᴜᴛᴏsᴛᴀᴛᴜs <ᴏɴ/ᴏғғ>
║ ❍ .ᴀᴜᴛᴏsᴛᴀᴛᴜs ʀᴇᴀᴄᴛ <ᴏɴ/ᴏғғ>
║ ❍ .ᴀᴜᴛᴏᴛʏᴘɪɴɢ <ᴏɴ/ᴏғғ>
║ ❍ .ᴀᴜᴛᴏʀᴇᴀᴅ <ᴏɴ/ᴏғғ>
║ ❍ .ᴀɴᴛɪᴄᴀʟʟ <ᴏɴ/ᴏғғ>
║ ❍ .ᴘᴍʙʟᴏᴄᴋᴇʀ <ᴏɴ/ᴏғғ/sᴛᴀᴛᴜs>
║ ❍ .ᴘᴍʙʟᴏᴄᴋᴇʀ sᴇᴛᴍsɢ <ᴛᴇxᴛ>
║ ❍ .sᴇᴛᴍᴇɴᴛɪᴏɴ
║ ❍ .ᴍᴇɴᴛɪᴏɴ <ᴏɴ/ᴏғғ>
╚══════════════════❒
ꜰᴏʟʟᴏᴡ ᴜꜱ ᴏɴ: «ᴡʜᴀᴛꜱᴀᴘᴘ»= https://whatsapp.com/channel/0029Vb5vbMM0LKZJi9k4ED1a
«ᴛᴇʟᴇɢʀᴀᴍ»=https://t.me/tktcybertech /https://t.me/+HxfKr3xq6OM1ZGU8`;

    try {
        const imagePath = path.join(__dirname, '../assets/bot_image.jpeg');

        const messageOptions = {
            contextInfo: {
                forwardingScore: 999,
                isForwarded: true,
                forwardedNewsletterMessageInfo: {
                    newsletterJid: '120363418027651738@newsletter',
                    newsletterName: 'ꜰᴏᴄᴜꜱ ᴍᴅ',
                    serverMessageId: -1
                }
            }
        };

        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
            await sock.sendMessage(
                chatId,
                {
                    image: imageBuffer,
                    caption: helpMessage,
                    ...messageOptions
                },
                { quoted: message }
            );
        } else {
            await sock.sendMessage(
                chatId,
                {
                    text: helpMessage,
                    ...messageOptions
                },
                { quoted: message }
            );
        }
    } catch (error) {
        console.error('Help command error:', error);
        await sock.sendMessage(chatId, { text: helpMessage }, { quoted: message });
    }
}

module.exports = helpCommand;
